var sam;
function result1(){
    document.getElementById("result1").style.display="inline";
}
function result2(){
          
    document.getElementById("result2").style.display="inline"; 
}
function result3(){
                
    document.getElementById("result3").style.display="inline";  
    document.getElementById("result4").style.display="inline"; 
}
function test() {
    
    document.getElementById("result1").style.display="none";
    document.getElementById("result2").style.display="none";
    document.getElementById("result3").style.display="none";
    document.getElementById("result4").style.display="none";
    var x =  Math.floor(Math.random() * 30); // 0 ~ 29
    var x1, y, y1, y2, y3
    if (x==sam) {
       if(x==0){
           x=x+1;
       } else {
          x=x-1;
       } 
    } 
    if (x==0) {
        x1="甲子乙丑"
        y="海中金(해중금)"
        y1="바다 속 쇠(소금), 죽어 있는 금속"
        y2="甲(1)+ 子(1) = 2(金)"
        y3="乙(1)+ 축(1) = 2(金)"
    } else if (x==1){
        x1="丙寅丁卯"
        y="爐中火(노중화)"
        y1="화롯불, 추위 견딜 정도"
        y2="丙(2)+ 寅(2) = 4(火)"
        y3="丁(2)+ 卯(2) = 4(火)"
    } else if (x==2){
        x1="戊辰己巳"
        y="大林木(대림목)"
        y1="큰 숲의 나무, 큰 나무"
        y2="戊(3)+ 辰(3) = 6-5 = 1(木)"
        y3="己(3)+ 巳(3) = 6-5 = 1(木)"
    } else if (x==3){
        x1="庚午辛未"
        y="路傍土(노방토)"
        y1="길 가의 흙"
        y2="庚(4)+ 午(1) = 5(土)"
        y3="辛(4)+ 未(1) = 5(土)"
    } else if (x==4){
        x1="壬申癸酉"
        y="劍鋒金(검봉금)"
        y1="칼,붓,침,주사기, 날카로움"
        y2="壬(5)+ 申(2) = 7-5=2(金)"
        y3="癸(5)+ 酉(2) = 7-5=2(金)"
    } else if (x==5){
        x1="甲戌乙亥"
        y="山頭火(산두화)"
        y1="산 정상의 불, 산불,혁명, 지는 해 "
        y2="甲(1)+ 戌(3) = 4(火)"
        y3="乙(1)+ 亥(3) = 4(火)"
    } else if (x==6){
        x1="丙子丁丑"
        y="澗下水(간하수)"
        y1="깊은 골짜기의 물, 약수 "
        y2="丙(2)+ 子(1) = 3(水)"
        y3="丁(2)+ 丑(1) = 3(水)"
    } else if (x==7){
        x1="戊寅己卯"
        y="城頭土(성두토)"
        y1="성벽 꼭대기의 흙, 넓은 벌판, 우두머리 "
        y2="戊(3)+ 寅(2) = 5(土)"
        y3="己(3)+ 卯(2) = 5(土)"
    } else if (x==8){
        x1="庚辰申巳"
        y="白蠟金(백납금)"
        y1="빙벽,빙하,납,무른 금속, 굳기위한 시간 필요"
        y2="庚(4)+ 辰(3) = 7-5 =2(金)"
        y3="申(4)+ 巳(3) = 7-5 =2(金)"
    } else if (x==9){
        x1="壬午癸未"
        y="楊柳木(양류목)"
        y1="버드나무, 작은나무"
        y2="壬(5)+ 午(1) = 6-5 =1(木)"
        y3="癸(5)+ 未(1) = 6-5 =1(木)"
    } else if (x==10){
        x1="甲申乙酉"
        y="泉中水(천중수)"
        y1="맑은 샘의 물, 지하수"
        y2="甲(1)+ 申(2) = 3(水)"
        y3="乙(1)+ 酉(2) = 3(水)"
    } else if (x==11){
        x1="丙戌丁亥"
        y="屋上土(옥상토)"
        y1="지붕 위 흙, 댐"
        y2="丙(2)+ 戌(3) = 5(土)"
        y3="丁(2)+ 亥(3) = 5(土)"
    } else if (x==12){
        x1="戊子己丑"
        y="霹靂火(벽력화)"
        y1="번개 불, 벼락, 비와 번개로 만물 소생"
        y2="戊(3)+ 子(1) = 4(火)"
        y3="己(3)+ 丑(1) = 4(火)"
    } else if (x==13){
        x1="庚寅辛卯"
        y="松柏木(송백목)"
        y1="푸른 소나무, 금극목 안됨"
        y2="庚(4)+ 寅(2) = 6-5= 1(木)"
        y3="辛(4)+ 卯(2) = 6-5= 1(木)"
    } else if (x==14){
        x1="壬辰癸巳"
        y="長流水(장류수)"
        y1="멀리 흐르는 물, 큰 강"
        y2="壬(5)+ 辰(3) = 8-5= 3(水)"
        y3="癸(5)+ 巳(3) = 8-5= 3(水)"
    } else if (x==15){
        x1="甲午乙未"
        y="砂中金(사중금)"
        y1="모래속 쇠(제련 필요), 숙살지기 불가"
        y2="甲(1)+ 午(1) = 2(金)"
        y3="乙(1)+ 未(1) = 2(金)"
    } else if (x==16){
        x1="丙申丁酉"
        y="山下火(산하화)"
        y1="산 아래의 불, 황혼, 아지랑이"
        y2="丙(2)+ 申(2) = 4(火)"
        y3="丁(2)+ 酉(2) = 4(火)"
    } else if (x==17){
        x1="戊戌己亥"
        y="平地木(평지목)"
        y1="넓게 자란 숲, 벼, 보리 (연약한 나무)"
        y2="戊(3)+ 戌(3) = 6-5 = 1(木)"
        y3="己(3)+ 亥(3) = 6-5 = 1(木)"
    } else if (x==18){
        x1="庚子辛丑"
        y="壁上土(벽상토)"
        y1="벽의 흙, 담벼락"
        y2="庚(4)+ 子(1) = 5(土)"
        y3="辛(4)+ 丑(1) = 5(土)"
    } else if (x==19){
        x1="壬寅癸卯"
        y="金箔金(금박금)"
        y1="얇은 쇠, 왕관, 외화내빈"
        y2="壬(5)+ 寅(2) = 7-5 =2(金)"
        y3="癸(5)+ 卯(2) = 7-5 =2(金)"
    } else if (x==20){
        x1="甲辰乙巳"
        y="覆燈火(복등화)"
        y1="뒤집힌 등불, 전등불"
        y2="甲(1)+ 辰(3) = 4(火)"
        y3="乙(1)+ 巳(3) = 4(火)"
    } else if (x==21){
        x1="丙午丁未"
        y="天下水(천하수)"
        y1="은하수, 장마비"
        y2="丙(2)+ 午(1) = 3(水)"
        y3="丁(2)+ 未(1) = 3(水)"
    } else if (x==22){
        x1="戊申己酉"
        y="大驛土(대역토)"
        y1="큰 길의 흙, 절정, 환절기"
        y2="戊(3)+ 申(2) = 5(土)"
        y3="己(3)+ 酉(2) = 5(土)"
    } else if (x==23){
        x1="庚戌辛亥"
        y="釵釧金(채천금)"
        y1="큰 길의 흙, 절정, 환절기"
        y2="庚(4)+ 戌(3) = 7-5 =2(金)"
        y3="辛(4)+ 亥(3) = 7-5 =2(金)"
    } else if (x==24){
        x1="壬子癸丑"
        y="桑柘木(상자목)"
        y1="뽕나무, 도움 되는 나무, 쓰기위해 잘리는 나무"
        y2="壬(5)+ 子(1) = 6-5 =1(木)"
        y3="癸(5)+ 丑(1) = 6-5 =1(木)"
    } else if (x==25){
        x1="甲寅乙卯"
        y="大溪水 (대계수)"
        y1="산과 큰 계곡의 물, 큰 강, 시냇물"
        y2="甲(1)+ 寅(2) = 3(水)"
        y3="乙(1)+ 卯(2) = 3(水)"
    } else if (x==26){
        x1="丙辰丁巳"
        y="沙中土 (사중토)"
        y1="모래에 섞여있는 흙, 모래"
        y2="丙(2)+ 辰(3) = 5(토)"
        y3="丁(2)+ 巳(3) = 5(토)"
    } else if (x==27){
        x1="戊午己未"
        y="天上火 (천상화)"
        y1="태양, 하늘의 불, 양기 강함"
        y2="戊(3)+ 午(1) = 4(火)"
        y3="己(3)+ 未(1) = 4(火)"
    } else if (x==28){
        x1="庚申辛酉"
        y="石榴木 (석류목)"
        y1="석류처럼 단단한 나무, 결실, 성실"
        y2="庚(4)+ 申(2) = 6-5 = 1(木)"
        y3="辛(4)+ 酉(2) = 6-5 = 1(木)"
    } else if (x==29){
        x1="壬戌癸亥"
        y="大海水 (대해수)"
        y1="큰 바다의 물, 바닷물, 강한 음의 기운"
        y2="壬(5)+ 戌(3) = 8-5 = 3(水)"
        y3="癸(5)+ 亥(3) = 8-5 = 3(水)"
    }
    sam=x;
    document.getElementById("check").innerHTML = x1;
    document.getElementById("result1").innerHTML = y;
    document.getElementById("result2").innerHTML = y1;
    document.getElementById("result3").innerHTML = y2;
    document.getElementById("result4").innerHTML = y3;
}
